# Задание № 6:
number = int(input("Введите трёхзначное число: "))
print(number[::-1])
