# Задание № 4:

A = float(input("Введите длину отрезка A: "))
B = float(input("Введите длину отрезка B: "))
if A > B:
    print("Количество отрезков B: ", A//B)
else:
    print("Неверные данные!")





