# Задание № 7:

x = int(input("Введите трёхзначное число: "))
y = x // 100
z = x % 100
print(str(z) + str(y))





