# Задание № 5:

number = int(input("Введите трёхзначное число: "))
a = number // 10
b = number // 100
c = number % 10
d = a % 10
print("Сумма: ", b + c + d)
print("Произведение: ", b * c * d)








