# Задание № 6:
number = str(input("Введите трёхзначное число: "))
print(number[::-1])
